//----------------------------------------------------------------------
//!Рассчитывает размер файла в байтах
//!@param		file_name				Имя файла
//!@return								Размер файла в байтах
//----------------------------------------------------------------------
unsigned int sizeof_file(const char* file_name);

//----------------------------------------------------------------------
//!Читает файл полностью
//!@param		filename				Имя файла
//!@return								Указатель на прочитанный файл
//----------------------------------------------------------------------
char* readfile(const char* filename);

//----------------------------------------------------------------------
//!Делает массив строк из строки
//!@param		s						Указатель на строку
//!@return								Указатель на строки
//----------------------------------------------------------------------
char** make_array_of_strings_beginnings(char* s);

//----------------------------------------------------------------------
//!Рассчитывает количество строк, разделенных при помощи \n в строке
//!@param		s						Указатель на строку
//!@return								Количество строк
//----------------------------------------------------------------------
int amount_of_strings(const char* s);

//----------------------------------------------------------------------
//!Делает массив строк из строки, разделяя их между собой символами sep
//!@param		s						Указатель на строку
//!@param		sep						Разделительный символ
//!@return								Количество строк
//----------------------------------------------------------------------
char** make_array_of_strings_beginnings_with_sep (char* s, char sep);


//----------------------------------------------------------------------
//!Заменяет все символы в строке на другие символы
//!@param		s						Строка
//!@param		what_to_replace			Какой символ заменять
//!@param		what_replace			Каким символом заменять
//!@return								Код ошибки
//----------------------------------------------------------------------
int replace_in_array(char* s, char what_to_replace, char what_replace);

//----------------------------------------------------------------------
//!Считает количество символов в строке
//!@param		s						Строка
//!@param		c						Какие символы считать
//!@return								Количество подсчитанных символов
//----------------------------------------------------------------------
int amount_of_char(const char* s, char c);
